Repository: autohotkey-docs-translation/v1-pt-br
Catalog: omegat/project_save.tmx
Source language: en
Languages: pt_br

source: UIA is only effective if the file is in a trusted location; i.e. a Program Files sub-directory.
pt_br: UIA só é eficaz se o arquivo estiver num local confiável; isto é, um subdiretório de “Arquivos de Programas”.

source: UIA.exe files cannot be modified, as it would invalidate the file's digital signature.
pt_br: Arquivos UIA não podem ser modificados, uma vez que isso invalidaria a assinatura digital do arquivo.

source: UIA.exe files cannot be started via CreateProcess due to security restrictions.
pt_br: Arquivos UIA.exe não podem ser iniciados via CreateProcess devido a restrições de segurança.

source: UIA.exe files created on one computer cannot run on other computers without first installing the digital certificate which was used to sign them.
pt_br: Arquivos UIA.exe criados em um computador não podem executar em outros computadores sem antes instalar o certificado digital que foi usado para assiná-los.

source: Unicode 32-bit.
pt_br: Unicode 32 bits.

source: Unicode 64-bit (only valid on 64-bit systems).
pt_br: Unicode 64 bits (só válida em sistemas de 64 bits).

source: Unicode characters in the range 0 to 65535 (U+FFFF) are represented by a single 16-bit code unit of the same value, while characters in the range 65536 (U+10000) to 1114111 (U+10FFFF) are represented by a surrogate pair; that is, exactly two 16-bit code units between 0xD800 and 0xDFFF.
pt_br: Caracteres Unicode no intervalo 0 a 65535 (U+FFFF) são representados por uma única unidade de código 16 bits do mesmo valor, enquanto os caracteres no intervalo 65536 (U+10000) a 1114111 (U+10FFFF) são representados por um par substituto; isto é, exatamente duas unidades de código 16-bits entre 0xD800 e 0xDFFF.

source: Unicode versions of AutoHotkey use UTF-16.
pt_br: As versões Unicode do AutoHotkey usam UTF-16.

source: Uninitialised Variables
pt_br: Variáveis Não Inicializadas

source: Unlike Ctrl/Alt/Shift, there is no generic/neutral "Win" key because the OS does not support it.
pt_br: Ao contrário do caso das teclas Ctrl/Alt/Shift, não há tecla "Win" genérica/neutra porque o sistema operacional não a suporta.

source: Until then, here's an explanation of the above code:
pt_br: Até lá, aqui está uma explicação do código acima:

source: Use FormatTime or built-in variables for date and time.
pt_br: Use o comando FormatTime ou as variáveis nativas para data e horário.

source: Use WinWait, WinWaitClose or WinWait[Not]Active.
pt_br: Use WinWait, WinWaitclose ou WinWait[Not]Active.

source: Use built-in variables for hotkeys as follows:
pt_br: Use variáveis nativas para hotkeys assim:

source: Use SendPlay via the SendPlay command, SendMode Play and/or the hotstring option SP.
pt_br: Use SendPlay via comando SendPlay, SendMode Play e/ou a opção SP das hotstrings.

source: Use the Send command.
pt_br: Use o comando Send.

source: Use the script by polyethene (examples are included).
pt_br: Use o script feito pelo polyethene (exemplos inclusos).

source: Use the tray menu or the ExitApp command to exit a script.
pt_br: Use o menu da bandejaou o comando ExitApp para finalizar um script.

source: Use the names of the keys (Tab and Space) rather than their characters.
pt_br: Use os nomes das teclas (Tab e Space) em vez de seus caracteres.

source: Use what is known as a continuation section.
pt_br: Use o que chamamos de continuação de seção.

source: Using Objects
pt_br: Usando objetos

source: Using a joystick as a mouse.
pt_br: usar o joystick como um mouse.

source: Using the Program
pt_br: Usando o Programa

source: Using the Program | AutoHotkey
pt_br: Usando o Programa | AutoHotkey

source: Usually a command or function accepts parameters which tell it how to operate or what to operate on.
pt_br: Geralmente um comando ou função aceita parâmetros que podem dizer ao comando ou função como operar ou em que operar.

source: Usually a unit wouldn't be deleted, but maybe the agent will have any junk you left behind removed; just as any values you stored in an object are freed when the object is deleted.
pt_br: Geralmente uma unidade residencial não seria deletada, mas talvez o representante da imobiliária providenciará a remoção de toda tralha que você tiver deixado para trás; da mesma forma que quaisquer valores armazenados num objeto são liberados quando o objeto é excluído.

source: Usually in such cases the message "7-zip Error" is displayed.
pt_br: Normalmente nestes casos a mensagem "Erro do 7-zip" é exibida.

source: Usually there is at least one parameter, and it is interpreted as the name of a property or method, a key or an array index, depending on the object and how you're using it.
pt_br: Normalmente existe pelo menos um parâmetro, e ele é interpretado como o nome de uma propriedade ou método, uma chave ou índice de vetor, dependendo do objeto e como você está usando-o.

source: Usually this gets the right result, but sometimes it doesn't.
pt_br: Normalmente isso leva ao resultado correto, mas nem sempre.

source: Usually this just improves the script's performance with no down-sides, but if a variable contains both a number and a string, is it number, or is it a string?
pt_br: Normalmente isso apenas melhora o desempenho do script sem reveses, mas se uma variável contiver tanto um número quanto uma string, então ela é um número, ou é uma string?

source: Value := Banana.Color
pt_br: Valor := Banana.Cor

source: Value := Banana["Color"]
pt_br: Valor := Banana["Cor"]

source: Values
pt_br: Valores

source: Var = Text
pt_br: Var = Texto

source: Var5 += Number
pt_br: Var5 += Numero

source: Var5 -= Number
pt_br: Var5 -= Numero

source: Var7 = %Var% Text
pt_br: Var7 = %Var% Texto

source: Variable References vs Values
pt_br: Referências a Variáveis x Valores

source: Variable names are always enclosed in percent signs except in cases illustrated in bold below:
pt_br: Nomes de variáveis são sempre envoltos em sinais de porcentagem exceto nos casos ilustrados em negrito abaixo:

source: Variables
pt_br: Variáveis

source: Variables and expressions
pt_br: Variáveis e expressões

source: Variables and their contents - See ListVars.
pt_br: Variáveis e seus conteúdos - Veja ListVars.

source: Variables can be assigned a few ways.
pt_br: Variáveis podem ser atribuídas (ter dados associados a elas) de alguns jeitos.

source: Variables do not need to be wrapped in percent signs:
pt_br: Variáveis não precisam estar envoltas em sinais de porcentagem:

source: Variables have certain attributes that blur the line between a variable and its value, but it is important to make the distinction.
pt_br: Variáveis têm certos atributos que turvam a linha que diferencia uma variável de seu valor, mas é importante fazer a distinção.

source: Version
pt_br: Versão

source: Very large
pt_br: Enorme

source: Very small
pt_br: Minúscula

source: Visible (default)
pt_br: Visível (padrão)

source: Visit Hotkeys and Hotstrings for additional hotkey and hotstring modifiers, information and examples.
pt_br: Visite Hotkeys e Hotstrings para modificadores, informações e exemplos adicionais.

source: Wait for Notepad to appear on the screen
pt_br: Aguardar que o Bloco de Notas apareça na tela

source: We call objects different things depending on what we are using them for, but all objects are the same.
pt_br: Nós chamamos diferentes coisas de objetos dependendo de para que estamos usando-os, mas todos os objetos são a mesma coisa.

source: We can do that.
pt_br: Podemos fazer isso.

source: We did not need curly brackets since there was only one line below it.
pt_br: Aqui, nós não precisamos de chaves pois havia somente uma linha sob a instrução.

source: We have reached the end of our journey, my good friend.
pt_br: Chegamos ao fim de nossa jornada, meu amigo.

source: We love to help, but we also do this for free on our own time.
pt_br: Amamos ajudar, mas também fazemos isto de graça (igual a esta tradução!) em nosso tempo livre.

source: We might be at work, sleeping, gaming, with family or just too busy to help.
pt_br: Podemos estar com a família, no trabalho, jogando, dormindo, ou simplesmente muito ocupados no momento.

source: We take one step at a time, and when that step is finished, we move on to the next step.
pt_br: Damos um passo de cada vez, e quando esse passo é concluído, passamos para o próximo.

source: We will become great friends.
pt_br: Nós nos tornaremos grandes amigos.

source: We will get more in-depth later on.
pt_br: Vamos nos aprofundar mais tarde.

source: We'll cover the most common forms.
pt_br: Vamos cobrir os mais comuns.

source: We're taking a shortcut by using the name of the variable to refer to its value, but "myArray" is really just the name of the variable; the array object doesn't know that it has a name, and could be referred to by many different variables (and therefore many names).
pt_br: O que estamos fazendo é tomar um atalho ao usar o nome da variável para se referir ao seu valor, mas “meuVetor” é na verdade apenas o nome da variável; o objeto vetor não sabe que ele tem um nome, e poderia ser referenciado por várias variáveis diferentes (portanto, vários diferentes nomes).

source: Welcome to AutoHotkey
pt_br: Bem-vindo ao AutoHotkey

source: Welcome...
pt_br: Bem-vindo...

source: Well, good question.
pt_br: Então... boa pergunta.

source: What can I do if AutoHotkey won't install?
pt_br: O que posso fazer quando eu não conseguir instalar o AutoHotkey?

source: What do I do?
pt_br: O que eu faço?

source: What if you wanted to use ExcludeTitle but not fill in WinText or WinTitle?
pt_br: E se você só quiser usar TituloExcluido mas não preencher o espaço dedicado aos parâmetros TextoJanela ou TituloJanela?

source: What is a hotkey?
pt_br: O que é uma hotkey (tecla de atalho)?

source: What is a hotstring?
pt_br: O que é uma hotstring?

source: Wheel
pt_br: Roda do Mouse

source: When #IfWin directives are never used in a script, all hotkeys and hotstrings are enabled for all windows.
pt_br: Quando as diretivas #IfWin não são usadas em nenhum lugar do script, então todas as hotkeys e hotstrings funcionarão em todas as janelas.

source: When not to use percent signs:
pt_br: Quando não usar sinais de porcentagem:

source: When a number is converted to a string, it is formatted according to the current integer or float format.
pt_br: Quando um número é convertido em uma string, ele é formatado de acordo com o formato de inteiro ou decimal atual.

source: When a value is required to be either true or false, a blank or zero value is considered false and all other values are considered true.
pt_br: Quando se exige que um valor seja verdadeiro ou falso, um valor em branco ou igual a zero é considerado falso e todos os demais valores são considerados verdadeiros.

source: When are quotation marks used with commands and their parameters?
pt_br: Quando são usadas aspas com os comandos e seus parâmetros?

source: When commas or percent signs are enclosed in quotes within an expression, the accent is permitted but not necessary.
pt_br: Quando vírgulas ou sinais de porcentagem estão entre aspas dentro de uma expressão, o acento é permitido mas não necessário.

source: When exactly are variable names enclosed in percent signs?
pt_br: Quando exatamente os nomes de variáveis devem ser envolvidos por sinais de porcentagem?

source: When referenced from code that came from an embedded resource, A_LineFile contains an asterisk (*) followed by the resource name.
pt_br: Quando referenciado por código que veio de um recurso incorporado, a variável A_LineFile contém um asterisco (*) seguido do nome do recurso.

source: When should percent signs and commas be escaped?
pt_br: Quando os sinais de porcentagem e vírgulas devem ser escapados?

source: When the function has completed its purpose, it returns control to the script.
pt_br: Quando a função completar seu propósito, ela retorna o controle ao script.

source: When the source of the main script is an embedded resource, the program acts in "compiled script" mode, with the exception that A_AhkPath always contains the path of the current executable file (the same as A_ScriptFullPath).
pt_br: Quando a fonte do script principal é um recurso incorporado, o programa age em “modo de script compilado”, com a exceção de que A_AhkPath sempre contém o caminho do arquivo executável atual (o mesmo que A_ScriptFullPath).

source: When the values are arrays too, this is referred to as a nested array, and these will be explained later.
pt_br: Quando os valores são vetores também, isso é chamado de vetor aninhado, que serão explicados mais tarde.

source: When to use percent signs:
pt_br: Quando usar os símbolos de porcentagem:

source: When to use percents
pt_br: Quando usar o símbolo de porcentagem

source: When using ControlSend, it is also necessary to escape literal commas (`,).
pt_br: Quando usar ControlSend também é necessário escapar vírgulas literais (`,).

source: When using commands, you cannot squish other commands onto the same line as a previous command (exception:
pt_br: Quando usar comandos, você não pode atochar outros comandos na mesma linha do comando anterior (exceção:

source: When writing your code, it is very important to NOT type the square brackets in your code.
pt_br: Quando estiver escrevendo seu código, é muito importante que você NÃO insira os colchetes nele!

source: When you are assigning a value to a variable using the legacy mode (an equal sign with no symbol in front of it).
pt_br: Quando você está atribuindo um valor a uma variável usando o modo legado (um sinal de igualdade sem nenhum símbolo na frente do “=”).

source: When you are making your code, you might have the urge to put several commands on the same line or inside of each other, don't.
pt_br: Quando você está montando seu código, você pode ficar com vontade de inserir vários comandos na mesma linha ou dentro um do outro. Não faça isso.

source: When you are using commands (see above), except when the parameter is OutputVar or InputVar.
pt_br: (respectivamente “variável de saída” e “variável de entrada”. Quando você está usando comandos (veja acima), exceto quando o parâmetro é OutputVar ou InputVar.

source: When you assign an object to a variable, as in myObj := {}, what you store is not the object itself, but a reference to the object.
pt_br: Quando você atribui um objeto a uma variável, como no exemplo meuObjeto := {}, o que você armazena não é o objeto em si, mas uma referência a ele.

source: When you create an object, the object is created at some location you don't control, and you're given a reference.
pt_br: Quando você cria um objeto, o objeto é criado em certo local que você não controla, e a você é dada uma referência.

source: When you hear people calling an object an array or indexed array, it usually means that all the keys are sequential numbers 1 and up.
pt_br: Quando você ouvir alguém chamar um objeto de vetor ou de vetor indexado, isso geralmente significa que todas as chaves são uma sequência de números começando em 1.

source: When you hear people calling an object an associative array, it means that the keys are either strings (text) or non-sequential numbers.
pt_br: Quando você ouvir alguém chamar um objeto de vetor associativo, significa que as chaves são ou strings (texto) ou números não sequenciais.

source: When you rent a unit, you're given a key which you can use to access the unit.
pt_br: Quando você aluga uma unidade residencial, você recebe uma chave que você pode usar para acessá-la.

source: Where can I find the official build, or older releases?
pt_br: Onde posso achar o build oficial, ou versões mais antigas?

source: Whether it's 1, or 3253 (or more).
pt_br: Sejam uma ou 3253.

source: Which value that is could change repeatedly during the time your script is running.
pt_br: Já qual valor é esse é algo que pode mudar repetidamente durante o tempo em que seu script estiver rodando.

source: While Ctrl is held down, NumLock produces the key code of Pause, so use ^Pause in hotkeys instead of ^NumLock.
pt_br: Enquanto Ctrl está pressionada, NumLock produz o código da tecla Pause, então use ^Pause nas hotkeys em vez de ^NumLock.

source: While Ctrl is held down, ScrollLock produces the key code of CtrlBreak, but can be differentiated from Pause by scan code.
pt_br: Enquanto Ctrl é mantida pressionada, ScrollLock produz o código da tecla CtrlBreak, mas pode ser diferenciado de Pause por meio do código de leitura.

source: While Ctrl is held down, Pause produces the key code of CtrlBreak and NumLock produces Pause, so use ^CtrlBreak in hotkeys instead of ^Pause.
pt_br: Enquanto a tecla Ctrl é mantida pressionada, Pause produz o código CtrlBreak e NumLock produz Pause, então use ^CtrlBreak nas hotkeys em vez de ^Pause.

source: While the text to replace your typed text goes on the right of the second pair of colons.
pt_br: Já o texto que substituirá sua abreviatura digitada deve vir à direita do segundo par de dois-pontos.

source: While there can only be one function named Send (for example), there can be as many methods named Send as there are objects, as each object (or class of objects) can respond in a different way.
pt_br: Embora só possa existir uma função denominada Send (por exemplo), pode haver tantos métodos denominados Send quanto for o número de objetos, já que cada objeto (ou classe de objetos) pode responder de uma maneira diferente.

source: Why am I seeing this?
pt_br: Por que estou vendo isto?

source: Why are the non-ASCII characters in my script displaying or sending incorrectly?
pt_br: Por que caracteres do meu script que não sejam ASCII estão sendo exibidos ou enviados incorretamente?

source: Why do Hotstrings, Send, and Click have no effect in certain games?
pt_br: Por que Hotstrings, Send e Click não têm efeito em alguns jogos?

source: Why do some lines in my script never execute?
pt_br: Por que algumas linhas do script nunca executam?

source: Why doesn't my script work on Windows xxx even though it worked on a previous version?
pt_br: Por que meu script não roda no Windows xxx mesmo que tenha funcionado em uma versão anterior?

source: Why don't Hotstrings, Send, and MouseClick work in certain games?
pt_br: Por que as Hotstrings, o comando Send e o comando MouseClick não funcionam em alguns jogos?

source: Why is the Run command unable to launch my game or program?
pt_br: Por que o comando Run é incapaz de executar meu jogo ou programa?

source: WinActivate, Untitled - Notepad
pt_br: WinActivate, Sem título - Bloco de Notas

source: WinClose ScriptFileName.ahk - AutoHotkey
pt_br: WinClose NomeDoArquivoDoScript.ahk - AutoHotkey

source: WinWaitActive Untitled - Notepad
pt_br: WinWaitActive Sem título - Bloco de Notas

source: WinWaitActive, Untitled - Notepad
pt_br: WinWaitActive, Sem título - Bloco de Notas

source: Window Spy - Displays various information about a window.
pt_br: Window Spy - Exibe várias informações sobre uma janela.

source: Window specific hotkeys/hotstrings
pt_br: Hotkeys e hotstrings que funcionam em só em uma ou algumas janelas

source: With AutoHotkey installed, there are several ways to run a script:
pt_br: Com o AutoHotkey instalado, há várias formas de executar um script:

source: With Internet Explorer, perhaps the most reliable method is to use DllCall() and COM as demonstrated at www.autohotkey.com/forum/topic19256.html.
pt_br: Com o Internet Explorer, talvez o método mais confiável seja usar DllCall() e COM como demonstrado em www.autohotkey.com/forum/topic19256.html.

source: With the exception of Clipboard, ErrorLevel, and command line parameters, these variables are read-only; that is, their contents cannot be directly altered by the script.
pt_br: Com a exceção de Clipboard, ErrorLevel e parâmetros da linha de comando, essas variáveis são somente leitura; isto é, seus conteúdos não podem ser diretamente alterados por um script.

source: Without them, only the first line in the block is called.
pt_br: Sem os blocos de código delimitados por chaves, somente a primeira linha do bloco é chamada.

source: Without them, programming and scripting would be much more tedious.
pt_br: Sem elas, a programação e a confecção de scripts seriam muito mais tediosas.

source: Yes, they do!
pt_br: Sim, elas têm!

source: Yes.
pt_br: Sim.

source: You are using MyVar to store the return value of the function that is to the right of the := operator.
pt_br: Você está usando MinhaVar para armazenar o valor de retorno da função que está à direita do operador :=.

source: You can also get help or find many useful scripts on our friendly discussion forum.
pt_br: Você também pode obter ajuda ou encontrar vários scripts úteis em nosso amigável fórum de discussão.

source: You can also try searching the forum for a keywords like RawInput*, USB HID or AHKHID.
pt_br: Você também pode tentar pesquisar o fórum por palavras-chaves como RawInput*, USB HID ou AHKHID.

source: You can change the action by replacing the Send, = line with line(s) of your choice.
pt_br: Você pode alterar a ação substituindo a linha Send, = com a linha(s) de sua escolha.

source: You can copy and paste most examples on this page.
pt_br: Você pode copiar e colar a maioria dos exemplos desta página.

source: You can define a custom combination of two (and only two) keys (except joystick buttons) by using & between them.
pt_br: Você pode definir uma combinação personalizada de duas (e somente duas) teclas (exceto botões de joystick) usando & entre elas.

source: You can do math in parameters if you force an expression with a single %, but that will not be covered.
pt_br: Você pode fazer operações matemáticas se você forçar uma expressão com um único %, mas isto não será coberto aqui.

source: You can do math in them:
pt_br: Você pode fazer operações matemáticas nelas:

source: You can do this by setting it to "", also known as an empty string.
pt_br: Você pode fazer isso mudando o valor para "", o que também é conhecido como string vazia.

source: You can get more keys and use them to access the same unit, but when you're finished with the unit, you must hand all keys back to the rental agent.
pt_br: Você pode obter mais chaves e usá-las para acessar a mesma casa, mas quando você tiver terminado seu período locatício, você deverá devolver todas as chaves ao responsável pela locação.

source: You can see a list of them at the command prompt by typing SET then pressing Enter.
pt_br: Você pode ver uma lista delas no prompt de comando digitando SET e depois Enter.

source: You can tell if a script has the keyboard hook by opening its main window and selecting "View->Key history" from the menu bar.
pt_br: Você pode determinar se um script possui o gancho de teclado abrindo sua janela principal e selecionando “View->Key history” a partir da barra de menus.

source: You can tell what a command is by looking at its syntax (the way it looks).
pt_br: Você pode identificar o que é um comando ao olhar para sua sintaxe, ou seja, sua forma, seu visual.

source: You can then type a name for the script (taking care not to erase the .ahk extension if it is visible).
pt_br: Você pode então digitar um nome para o script (cuidando para não apagar a extensão .ahk se ela estiver visível).

source: You can usually edit a script file by right clicking it and selecting Edit Script.
pt_br: Você geralmente pode editar um arquivo de script clicando com o botão direito e selecionando Edit Script.

source: You cannot merge commands
pt_br: Você não pode mesclar comandos

source: You cannot put commands inside the parameters of other commands.
pt_br: Você não pode pôr comandos dentro dos parâmetros de outros comandos.

source: You cannot use variables in your keys with dot notation.
pt_br: Você não pode usar variáveis em suas chaves com a notação de ponto.
